:PROPERTIES:
:ID:       9dce85a8-db64-4c5b-a507-3d6931b13e6b
:END:
#+ti1tle: go文档
* 代码块与作用域:如果保证变量不会被遮蔽
:PROPERTIES:
:ID:       baae8b56-ab4d-41f3-9a1d-6744a01ca2e5
:END:

1. 变量遮蔽

#+begin_src go
import "fmt"

var a = 10

//包级变量没有参与计算中
func foo(n int){
	a := 1
	a += n
}

func main(){
fmt.Println("a = ", a)
foo(20)
fmt.Println("a = ",a)
}
#+end_src

#+RESULTS:
: a =  10
: a =  10

2.宇宙代码块
